app/controllers/animals_controller.rb

SELECT "animals".* FROM "animals"
---
    def index
        animals = Animal.all

SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        animal = Animal.find(params[:id])

INSERT INTO "animals" ("common_name", "latin_name", "kingdom", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["common_name", "Skunk"], ["latin_name", "Mephitidae"], ["kingdom", "Animalia"], ["created_at", "2020-06-03 21:39:25.418084"], ["updated_at", "2020-06-03 21:39:25.418084"]]
---
    def create
        animal = Animal.create(animal_params)

SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "animals" WHERE "animals"."id" = ?  [["id", 11]]
---
    def destroy
        animal = Animal.find(params[:id])
        if animal.destroy

SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "animals" SET "common_name" = ?, "updated_at" = ? WHERE "animals"."id" = ?  [["common_name", "Foxy"], ["updated_at", "2020-06-03 21:59:11.667669"], ["id", 1]]
---
    def update
        animal = Animal.find(params[:id])
        animal.update(animal_params)