app/controllers/sightings_controller.rb

    def index
        sightings = Sighting.where(date: params[:start_date]..params[:end_date])
---
SELECT "sightings".* FROM "sightings" WHERE "sightings"."date" >= ?  [["date", "2020-01-05 00:10:29"]]

    def create
        sighting = Sighting.create(sighting_params)
---
INSERT INTO "sightings" ("date", "lat", "long", "animal_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2020-02-03 12:04:55"], ["lat", "45.5204° N"], ["long", "122.6562° W"], ["animal_id", 1], ["created_at", "2020-06-03 23:23:40.337123"], ["updated_at", "2020-06-03 23:23:40.337123"]]

    def destroy
        sighting = Sighting.find(params[:id])
        if sighting.destroy
---
SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "sightings" WHERE "sightings"."id" = ?  [["id", 1]]